{"gid":"5121196841299793525","title":"Notice on Castle Siege Eve (Apr. 10th ~ Apr. 15th)","url":"https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5121196841299793525","is_external_url":true,"author":"MIR4","contents":"[img]{STEAM_CLAN_IMAGE}/40990380/6af141bf5aa329b6ba28d7919a63cbe324b936d3.png[/img]\n\n[b]From my battle to our war, MMORPG MIR4[/b]\n\nGreetings, This is MIR4.\n\nWe'd like to introduce upcoming event 'Castle Siege Eve'.\n\nCastle Siege Eve is an exclusive event for the Castle Siege where players can root for the side that they support and gain special items before the Castle Siege.\n\n※ You are able to receive the effect of Castle Siege Codex during certain period only, please refer to below details about Castle Siege Eve.\n\n[Root for the Castle Siege with Drum of Victory!]\n\n[b]■ Event Period[/b] : Apr. 10th (Mon) 00:00 ~ Apr. 15th (Sat) 23:59\n※ Schedule will be based on Regional Server Times.\nASIA(UTC+8)/INMENA(UTC+6)/EU(UTC+2)/SA(UTC-3)/NA(UTC-4)\n※ It will proceed for 6 days starting from Monday to Saturday of the week before the Castle Siege.\nEx) If the Castle Siege is scheduled on Apr. 16th (Sun), Siege Eve will be from Apr. 10th (Mon) to Apr. 15th (Sat).\n\n[b]■ Content[/b]\n- 'Drum of Victory' item can be gained through the hunting (Enable to acquire maximum of 100 pieces per day, initialize daily acquisition based on 00:00)\n※ However, if the character's level and the monster's level differ between 20 or more, you are not able to obtain \"Drum of victory\" item even if you hunted the monster.\n※ All of the Drum of Victory items will be deleted on Sunday 00:00 which is the D-day of the Castle Siege.\n- You can cheer the side of which you wish to victory by using 'Drum of Victory' item within the event page(10 pieces of 'Drum of Victory' per 1 time of Cheer)\n- 'Cheer' can be used 10 times per day and 60 times for maximum regardless of the side during the event period. The victorious side will get an additional buff of 'Battlefield Drum'\n※ 'Battlefield Drum' will give All ATK DMG Boost 3% and All DMG Reduction 3%, effects will be applied only on the Castle Siege area.\n- 'Offense Kingdom Coffer' will be given if you cheer for the Offensive Clan and 'Defense Kingdom Coffer' will be given if you cheer for the Defensive Clan. (1 item per 1 cheer)\n※ You are able to gain 'Kingdom Codex Badge' which can be registered in Codex with the certain chance.\n※ You can gain 1 of the items listed below randomly by using Offense Kingdom Coffer or Defense Kingdom Coffer.\n- Offense and Defense Kingdom Coffer have same components\n\n[b][Components][/b]\n1. Vigor Pill (60 Mins)_Not Tradable\n2. 60 Minutes Speed-up Ticket_Not Tradable\n3. Copper\n4. Energy\n5. 3 Hours Speed-up Ticket_Not Tradable\n6. Rare Oil_Not Tradable\n7. Rare Snow Panax_Not Tradable\n8. Rare Divine Water_Not Tradable\n9. Magic Square Ticket_Not Tradable\n10. Secret Peak Ticket_Not Tradable\n11. Rare Noirsoul Herb_Not Tradable\n12. Uncommon Mystic Enhancement Stone_Not Tradable\n13. Epic Advancement Tonic_Not Tradable\n14. Epic Greed Tonic_Not Tradable\n15. Epic Prosperity Tonic_Not Tradable\n16. Spirit Stone Summon Ticket_Not Tradable\n17. Skill Tome Summon Ticket_Not Tradable\n18. Dragon Material Summon Ticket_Not Tradable\n19. Kingdom Codex Badge_Tradable\n20. Kingdom Codex Badge_Not Tradable\n\n※ Way to Participate Castle Siege Eve\n1. After logging in to the game, click the Event menu (Firecracker shaped icon on the top left corner).\n2. Select 'Castle Siege Eve' tab from the menu in the Event page.\n3. During the Event period, you can gain Drum of Victory for certain chance by hunting in Field, Elite, Labyrinth, Hidden Valley and cheer Defense / Offense side 60 times for maximum. For each Cheer, you are able to acquire 'Offense Kingdom Coffer' or 'Defense Kingdom Coffer'(10 pieces of 'Drum of Victory' per 1 time of Cheer)\n4. You can check the side who has won the Cheering Match on the D-day of the Castle Siege (Sunday 00:00)\n5. The victorious side from Cheering Match will get an additional buff of 'Battlefield Drum' when the Castle Siege will be proceeding.\n6. Enable to register acquired 'Kingdom Codex Badge' by using Coffer at Limited Event Codex.\n-----------\n- Bicheon Conqueror's Blessing [1] : Accuracy+15 => Kingdom Codex Badge*1\n- Bicheon Conqueror's Blessing [2] : Evade+15 => Kingdom Codex Badge*1\n- Bicheon Conqueror's Blessing [3] : Monster ATK DMG Boost 6% => Kingdom Codex Badge*1\n- Bicheon Conqueror's Blessing [4] : Boss ATK DMG Boost 6% => Kingdom Codex Badge*1\n- Bicheon Conqueror's Blessing [5] : Lucky Drop Chance Boost 4% => Kingdom Codex Badge*2\n- Bicheon Conqueror's Blessing [6] : Drop Chance Boost 4% => Kingdom Codex Badge*2\n- Bicheon Conqueror's Blessing [7] : Hunting EXP Boost 4% => Kingdom Codex Badge*3\n- Bicheon Conqueror's Blessing [8] : All ATK DMG Boost 2% => Kingdom Codex Badge*3\n- Bicheon Conqueror's Blessing [9] : All ATK DMG Reduction 2% => Kingdom Codex Badge*3\n- Bicheon Conqueror's Blessing [10] : Skill Cooldown Reduction 2% => Kingdom Codex Badge*4\n- Bicheon Conqueror's Blessing [11] : Skill ATK DMG Boost 3% => Kingdom Codex Badge*4\n-----------\n※ Please read it carefully about 'Kingdom Codex Badge' and initialize exclusive Codex of Castle Siege\n- 'Kingdom Codex Badge' is item that is able to register on 'Bicheon Conqueror's Blessing'(Exclusive Codex of Castle Siege)\n- You are able to acquire Tradable or Not Tradable item of 'Kingdom Codex Badge' with certain chance.\n- 'Bicheon Conqueror's Blessing' is the fix-term codex, effect will be maintained 27 days for maximum\n- You can register 'Kingdom Codex Badge' item to 'Bicheon Conqueror's Blessing' codex from starting date of Castle Siege Eve.\n- 'Kingdom Codex Badge' is a permanent fix-term item. You are able to register remained 'Kingdom Codex Badge' to 'Bicheon Conqueror's Blessing' Codex during any 'Exclusive Codex of Castle Siege' registration period.\n- If you gain Tradable 'Kingdom Codex Badge', you are able to register it to codex or sell / buy it through the Market.\n\n[b][Round-up of Castle Siege FAQ][/b]\nQ1) I can't acquire the Drum of Victory during the Castle Siege Eve event period.\nA) You are able to acquire the Drum of Victory up to 100 pieces per daily during the event period.\nQ2) I wanted to acquire the Defense Kingdom Coffer, but I acquired the Offense Kingdom Coffer by my mistake.\nA) Those items have different titles, but the acquirable items through the Coffer are same.\nQ3) Drum of Victory that collected during the Castle Siege Eve event period is disappeared.\nA) You are able to use the Drum of Victory until Saturday 23:59 pm, it will be deleted on Sunday 00:00 am.\nQ4) Is remained Kingdom Codex Badge deleted after the Castle Siege Eve event period?\nA) Remained Kingdom Codex Badge is not deleted, you are able to register it whenever you want within the 'Exclusive Codex of Castle Siege' registration period.\nQ5) 'Bicheon Conqueror's Blessing' Codex effect has been disappeared.\nA) 'Bicheon Conqueror's Blessing' is the fix-term codex, effect will be maintained up to 27 days from starting date of Castle Siege Eve event.\nQ6) I can't understand Castle Siege Eve event period and 'Exclusive Codex of Castle Siege' registration period.\nA) Castle Siege Eve will proceed for 6 days starting from Monday to Saturday of the week before the Castle Siege.\nEx) If the Castle Siege is scheduled on Apr. 16th (Sun), Siege Eve will be from Apr. 10th (Mon) to Apr. 15th (Sat).\nYou are able to register 'Kingdom Codex Badge' item to 'Bicheon Conqueror's Blessing' up to 27 days from the starting date of Castle Siege Eve event.\n※ Please remind that 'Bicheon Conqueror's Blessing' will be initialized after 27 days from the starting date of Castle Siege Eve event.\nQ7) I can't acquire 'Kingdom Codex Badge' by using Kingdom Coffer.\nA) You can gain 'Kingdom Codex Badge' with certain chance in the Kingdom Coffer. Also, you can buy it through the Market.\n\nThank You.","feedlabel":"Community Announcements","date":1681056011,"feedname":"steam_community_announcements","feed_type":1,"appid":1623660}