{"gid":"5143713753740152491","title":"[Notice] Portrait Event (Mar. 27th ~ April. 3rd)","url":"https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5143713753740152491","is_external_url":true,"author":"MIR4","contents":"[img]{STEAM_CLAN_IMAGE}/40990380/6af141bf5aa329b6ba28d7919a63cbe324b936d3.png[/img]\n\n[h2]From my battle to our war, MMORPG MIR4[/h2]\n\nGreetings, This is MIR4. \n\nWe are here to inform you of the event ‘Portrait’ that is back again after 4 weeks.\n\nThis event is a ranking-based event concerning the following accumulation of collection points obtained from Dragonians’ cooperation in the same clan, and special buffs will be granted with the following ranking place.\n\nPlease refer to the information below for further details.\n\n[b]■ Period [/b]\n- Monday, March 27th, 01:00 ~ Monday, April 3rd, 01:00 (Regional Server Time)\n\n[b]■ Item Deletion[/b] \n- Monday, April 3rd, 01:00 (Regional Server Time)\n\n[b]■ Details[/b]\n- You can obtain 'Portrait' items by defeating monsters during the event period.\n- Collection reward will be provided upon collecting 8 portraits and can be obtained 5 times per day by clicking ‘Obtain’ on the event page.\n- ‘Legendary Blue Dragon Statue’ can be obtained as a First-time Collection completion Reward, and 1 'Painter Manho's Treasure bag’ will be obtained as a Repeat completion reward.\n- If you lack a certain portrait, it can be exchanged in the Exchange Center on the event page and registration will be limited to once per try.\n- Portrait Ranking will be reset at 01:00:00 (Regional Server Time) every day, and you can view through [Menu] - [Ranking] - [Clan] - [Collect Portraits].\n- The ranking will be placed with the following accumulated collection points, and special buffs will be granted to the ranked clans for 3 weeks.\n\n[b]※ Portrait Ranking Reset Timeline [/b]\n- 01:00 (Regional Server Time) every day\n\n[b]■ How to participate[/b]\n1. Click the event menu (Fire-Cracker-shaped icon at the top left)\n2. Click 'Collect Portraits' on the event page menu\n3. Hunt to Obtain ‘Portrait’ from Field, Elite, Labyrinth, and Hidden Valley with random chance\n※ Portraits that lack of can be exchanged with other clan members through the Exchange Center.\n4. Click the ‘Obtain’ to obtain Collection Reward and Collection Point on the event page\n5. Clan rankings will be placed based on the deadline of the Collection period with the following accumulated points, and special buffs will be granted to the ranked clans for 3 weeks as a ranked-in reward.\n\n[b]■ Special Buff Effects[/b]\n[b]※ Special Buffs in details are as follows:[/b]\n[table]\n    [tr]\n        [th]Ranking[/th]\n        [th]Drop Chance Boost[/th]\n        [th]Lucky Drop Chance Boost[/th]\n        [th]Hunting Copper Gain[/th]\n        [th]Hunting EXP Gain[/th]\n    [/tr]\n    [tr]\n        [td]1st[/td]\n        [td]5%[/td]\n        [td]5%[/td]\n        [td]5%[/td]\n        [td]5%[/td]\n    [/tr]\n    [tr]\n        [td]2nd[/td]\n        [td]4%[/td]\n        [td]4%[/td]\n        [td]4%[/td]\n        [td]4%[/td]\n    [/tr]\n    [tr]\n        [td]3rd[/td]\n        [td]3%[/td]\n        [td]3%[/td]\n        [td]3%[/td]\n        [td]3%[/td]\n    [/tr]\n    [tr]\n        [td]4~10th[/td]\n        [td]3%[/td]\n        [td]3%[/td]\n        [td]3%[/td]\n        [td]-[/td]\n    [/tr]\n    [tr]\n        [td]11~15th[/td]\n        [td]3%[/td]\n        [td]3%[/td]\n        [td]-[/td]\n        [td]-[/td]\n    [/tr]\n    [tr]\n        [td]16~20th[/td]\n        [td]3%[/td]\n        [td]-[/td]\n        [td]-[/td]\n        [td]-[/td]\n    [/tr]\n[/table]\n[b]※ Caution[/b]\n- Portrait items will be deleted after the deadline of the term's Collecting period.\n- Registration for Exchange in the Exchange shop will be available 1 per exchange as Max.\n- You cannot obtain 'Portrait' from monsters above/below Level 20.\n- The special buff will be granted to the 'Clan' that is ranked in the Portrait ranking, and if you have left the clan during the buff period, you will no longer be buffed. (In contrast, if a Dragonian who was in the Clan that was not ranked has joined the Ranked Clan, the special buff will be granted.)\n- Portraits that have not been retrieved after registering to the Exchange Center will be deleted upon leaving the Clan.\n- Collecting will be available for 1 week after the beginning period, and special buffs will be granted for 3 weeks based on the Portrait ranking place after the Collecting period has ended.\n- If the accumulation points are calculated the same in the Portrait ranking, Clans with fewer members will be ranked higher, and if the number of Clan members is the same, Clans with the higher Power score will be ranked higher. \n- The next portrait event will begin based on the deletion of the Ranking buffs.\n\nThank You.","feedlabel":"Community Announcements","date":1679850009,"feedname":"steam_community_announcements","feed_type":1,"appid":1623660}