{"gid":"6839319551997454466","title":"Patch Note - April 4th","url":"https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/6839319551997454466","is_external_url":true,"author":"MIR4","contents":"[img]{STEAM_CLAN_IMAGE}/40990380/a7e589ef36b41e20217bb1534946636a9c1cf5d3.png[/img]\n\n[h2]From my battle to our war, MMORPG MIR4[/h2]\n\nGreetings, This is MIR4.\nWe’re excited to share the details of the update scheduled for Tuesday, April 4th, 2023.\n\n=========================\n\n[h3][Main Updates][/h3]\n\n[b]◈In-Game Updates◈[/b]\n\n1. Tower of Black Dragon 4F Unlocked!\n- Unleash your true potential and conquer the Tower of Black Dragon's 4th floor! Gear up and brace yourself for a thrilling challenge that promises a wealth of amazing rewards!\n2. New Equipment Enhancement: Dragon Forge\n- Forge your path to supremacy with Dragon Forge and enhance  your Legendary IV Tier equipment to its ultimate form.\n3. New Epic Spirit: Dark Assassin Zakhan\n- Harness the deadly power of the new Epic Forest Spirit, Dark Assassin Zakhan! Boost your skills with a passive +20 Spell ATK bonus, and dominate the competition with powerful skills like Echolocation, Guano Pill, and Vitality Extortion!\n4. New Equipment Appearance: ‘Radiant Youth’\n- School your enemies with the new Radiant Youth outfit!\n5. New Mount: ‘White Wayfarer Cat’\n- Say hello to your new purr-fect ride - the White Wayfarer Cat mount!\n\n[b]◈Official Forum Update◈[/b]\n1. Criteria for signing in the official Forum changes.\n- The criteria for signing in to the official Forum will change to comply with the global privacy policy.\n\n=========================\n\n[h3][April 4th Patch Note Details][/h3]\n\n[b]◈In-Game Updates◈\n■  Portal\n● Tower of Black Dragon 4F is now available.[/b]\n - Required Level : Level 135 or above\n - Required Power Score : 159,700\n - Monster Level : 155~180\n\n[b]● Tower of Black Dragon 4F Exclusive content[/b]\n - Monster ‘Diabolic Skydragon’ will have a 10% chance of being summoned by defeating the Field Boss 'Juja Neoul'.\n\n[b]● Crafting Manuals for Summon Badge in Tower of Black Dragon[/b]\n  1) Tower of Black Dragon 2F:\n - 3-player Boss Monster: Moska Summon Badge (x1)+ Dragonsteel (x1) = Lazaison Summon Badge (x1).\n - 5-player Boss Monster: Ganiyado Summon Badge (x1) + Dragonsteel (x2) = Kaguiv Summon Badge (x1).\n - 10-player Boss Monster: Dreadhide Dragon Summon Badge (x1) + Dragonsteel (x4) = Deranged Darkwing Summon Badge (x1).\n\n 2) Tower of Black Dragon 3F:\n - 3-player Boss Monster: Lazaison Summon Badge (x1) + Dragonsteel (x2) = Lifedeath Dragon Summon Badge (x1).\n - 5-player Boss Monster: Kaguiv Summon Badge (x1) + Dragonsteel (x4) = Makaraz Summon Badge (x1).\n - 10-player Boss Monster: Deranged Darkwing Summon Badge (x1) + Dragonsteel (x8) = Monstrum Summon Badge (x1).\n\n3) Tower of Black Dragon 4F:\n - 3-player Boss Monster: Lifedeath Dragon Summon Badge (x1) + Dragonsteel (x5) = Demonic Termina Summon Badge (x1).\n - 5-player Boss Monster: Makaraz Summon Badge (x1) + Dragonsteel (x10) = Trine Termina Summon Badge (x1).\n - 10-player Boss Monster: Monstrum Summon Badge (x1) + Dragonsteel (x20) = Unhallowed Termina Summon Badge (x1).\n\n[b]■  Forge\n● New Equipment Enhancement Feature, 'Dragon Forge' is Now Available[/b]\n - Use the Dragon Forge on Legendary IV Tier equipment to increase their stats.\n - Dragon Forge consists of 7 stages, each requiring 4 specific materials and a set amount of resources to progress.\n - Legendary White and Black Dragon Essence are new materials required for Dragon Forge, which can be obtained from various contents.\n[img]{STEAM_CLAN_IMAGE}/40990380/1543d7d33da65a8d17f1adfe5620e563be891cbc.png[/img]\n - Items that are available for Dragon Forge\n・Weapon (Weapon, Secondary Weapon)\n・Armor (Top, Bottom, Gloves, Shoes)\n・Accessory (Necklace, Bracelet, Ring, Earring)\n\n[b]※ The Success Chance for Dragon Forge varies per stage, and the targeted equipment will not be destroyed if the forging fails.\n※ Please refer to Game Encyclopedia > Forge > [url=https://forum.mir4global.com/post/34][Dragon Forge][/url] for further details.[/b]\n\n[b]■ Spirit\n● New Epic Forest Spirit ‘Dark Assassin Zakhan’ will be added.[/b]\nPassive Bonus Once Summoned : Spell ATK +20\n[img]{STEAM_CLAN_IMAGE}/40990380/65e24df5784f531368d539c366065024a2d54873.png[/img]\n[table]\n    [tr]\n        [th]Skill[/th]\n        [th]Skill Effect[/th]\n    [/tr]\n    [tr]\n        [td]Echolocation[/td]\n        [td]Increases Max HP by 1600, Max MP by 500, Skill DMG Reduction by 15%, and Bash ATK DMG Boost by 25%.[/td]\n    [/tr]\n    [tr]\n        [td]Guano Pill[/td]\n        [td]Increases Antidemon Power by 10%, Skill HP Recovery Am't Boost by 15%, and Stun Success Boost by 20%, and reduces Skill MP Cost by 5%.[/td]\n    [/tr]\n    [tr]\n        [td]Vitality Extortion[/td]\n        [td]Upon attacking an enemy with a Bash, there is a 10% chance to recover 5% of Max HP and 8% of Max Vitality. Cooldown 30 sec.[/td]\n    [/tr]\n[/table]\n[b]■ Item\n● Addition of Material Items[/b]\n - 2 materials required for Dragon Forge have been added:\n - Legendary White and Black Dragon Essence\n - Source to Obtain\n・Legendary Gathering/Energy : Legendary White Dragon Essence\n・Legendary Mining/Darksteel : Legendary Black Dragon Essence\n・Completion Reward for Clan Challenge Stage 4 or above\n・Completion Reward for Raids that are more difficult than Wailing Dead Mine and Boss Raid that are more difficult than Nefariox King\n・Hell Raid Completion Reward\n・Defeat Reward obtainable from Boss monster ‘Juja Neoul’ or ‘Diabolic Skydragon’ in Tower of Black Dragon 1~4F\n・Craftings from NPC ‘Millennial Fox Solari’ in Arcadia Spirit Village.\n\n[b]※ The new materials may be granted with tradable property with a low chance.[/b]\n\n[b]● Item Drop Source Expanded[/b]\n - The additional acquisition route for Drum of Victory, Portrait, and Monster hunting-themed event items will be updated.\n - Source to Obtain\n・Magic Square 1F~9F\n・Secret Peak 1F~9F\n\n[b]● Increase in the Item Drop Chance of certain items in Magic Square and Secret Peak[/b]\n - The Drop Chance for Epic Eternal Snow Panax and Epic Azureum Mineral Fluid will be increased in Magic Square/Secret Peak 4F~9F.\n\n[b]■ Outfit\n● ‘Radiant Youth’ outfits for MIR4 characters are now available![/b]\n - The outfit is purchasable with the Radiant Youth Exchange Ticket.\n・Radiant Youth\n[img]{STEAM_CLAN_IMAGE}/40990380/5d009a05d5bc5a50eb5e2d550308630dcfbe0955.jpg[/img]\n\n[b]■ Mount\n● New Mount ‘White Wayfarer Cat' [/b]\n - You can exchange the new mount with [White Wayfarer Cat Exchange Ticket].\n・White Wayfarer Cat\n[img]{STEAM_CLAN_IMAGE}/40990380/c5d39e372d6b0eb37a8b2871fb25453c984720ef.png[/img]\n\n[b]◈Official Forum Updates◈[/b]\n\n[b]■ Sign in condition changes\n1) Guest login for the Official Forums (Dragonian_No.) will no longer be available.[/b]\n - The temporary nickname given before setting a Representative Character has been removed.\n - You now need a MIR4 game account to use the official forum.\n2) If no Representative Character has been set, the character with the highest level will be automatically set as the Representative Character.\n - You can also change the Representative Character on your own.\n3) You must agree to the MIR4 Terms of Use and Privacy policy to use specific features on the Official Forum.\n - To access specific features, such as 1:1 inquiry or registering a coupon, which require your private information, you must agree to the Terms of Use and Privacy Policy of MIR4.\n\n[b]※ Posts (notices, patch notes, etc.) that do not require any private information can be viewed without signing in.[/b]\n\n[b]■ In-game bug fixes & gameplay improvements[/b]\n1. Improved Camera functionality to zoom in and out seamlessly on every menu, perfectly aligned with the actual gameplay for a more immersive and cohesive experience.\n - Implemented on: Equipment, Basic Info/Other User’s Info,  Mystical Piece, Outfit, and Wearable costumes.\n2. Improved the Source of items that can be obtained (such as from Divine Dragon's Promise) to be viewable.\n3. Fixed the issue where the HP of the Boss Monster 'Warswine King' in the 'Forgotten Area' was abnormally reset upon receiving the 'Knocked-Out’ status.\n4. Fixed the issue where monsters in a specific location in Dead Mine 3F occasionally move to an unattackable position.\n5. Fixed the item name ‘Rare Noirsoul Herb Box’ that was being displayed as 0.","feedlabel":"Community Announcements","date":1680550232,"feedname":"steam_community_announcements","feed_type":1,"appid":1623660}